import tkinter as tk
from tkinter import ttk
import ttkbootstrap as ttkbs
from PIL import Image, ImageTk


class InvoiceEntry(tk.Frame):
    """
    发票入账
    """
    def __init__(self,master):
        tk.Frame.__init__(self,master)
        self.master = master
        master.title("财务流程自动化 - 发票入账")
        left_frame = ttk.Frame(self, style="primary.TFrame", padding=10)
        left_frame.pack(fill="y", side="left")
        style = ttkbs.Style(theme="minty")

        button_tax_processing = ttk.Button(left_frame, text="税务处理", 
                                           style="primary.Outline.TButton")
        button_tax_processing.pack(side="top", padx=5, pady=5)

        button_voucher_generation = ttk.Button(left_frame, text="凭证生成", 
                                               style="primary.Outline.TButton")
        button_voucher_generation.pack(side="top", padx=5, pady=5)

        button_accounting_processing = ttk.Button(left_frame, text="会计处理", 
                                                  style="primary.Outline.TButton")
        button_accounting_processing.pack(side="top", padx=5, pady=5)

        button_entry_operation = ttk.Button(left_frame, text="入账操作", 
                                            style="primary.Outline.TButton")
        button_entry_operation.pack(side="top", padx=5, pady=5)

        button_accounting_records = ttk.Button(left_frame, text="账务记录", 
                                               style="primary.Outline.TButton")
        button_accounting_records.pack(side="top", padx=5, pady=5)

        button_report_generation = ttk.Button(left_frame, text="报表生成", 
                                              style="primary.Outline.TButton")
        button_report_generation.pack(side="top", padx=5, pady=5)

        table_frame = ttk.Frame(self)
        table_frame.pack(fill="both", expand=True, padx=10, pady=5)

        style.configure("Treeview", background="#f9f9f9", foreground="black", font=('微软雅黑', 10))
        style.configure("Treeview.Heading", font=('微软雅黑', 10, 'bold'))

        columns = ("序号", "报销单号", "发票代码", "发票号码", "购买方企业名称", "销方名称",
                   "发票组号码", "价税合计", "金额", "税额", "用途")
        self.tree = ttk.Treeview(table_frame, columns=columns, show="headings")

        for col in columns:
            self.tree.heading(col, text=col, anchor=tk.CENTER)
            self.tree.column(col, anchor=tk.CENTER, minwidth=50, width=100)

        data = [
            [1, 5400111631, None, '24312000000031337591', '嘉世坚国际货运代理(上海)有限公司',
             '嘉世坚国际货运代理（上海）有限公司', '24312000000031337591', 9082.8, 9082.80, 0.00, '货运代理服务的费用'],
            [2, 5400107902, 3200232160, '02174428', '中信泰富钢铁贸易有限公司', '中信泰富钢铁贸易有限公司',
             '02174428/29', 172282.3, 152462.21, 19820.09, '钢铁贸易业务的购销款项'],
            [3, 5400108169, 3200232160, '02174430', '中信泰富钢铁贸易有限公司', '中信泰富钢铁贸易有限公司',
             '02174430-43/02174659', 179046, 158447.79, 20598.21, '钢铁贸易业务的购销款项'],
            [4, 5400110249, 3200232160, '02174444', '中信泰富钢铁贸易有限公司', '中信泰富钢铁贸易有限公司',
             '02174444-49', 184697.6, 163449.2, 21248.4, '钢铁贸易业务的购销款项'],
            [5, 5400111611, 3100231130, '29062655', '柯尼卡美能达办公系统(中国)有限公司',
             '柯尼卡美能达办公系统（中国）有限公司', '29062655/48', 735, 650.44, 84.56, '洗衣服务费用'],
            [6, 5400111625, None, '24312000000028128290', '上海华记洗衣有限公司', '上海华记洗衣有限公司',
             '24312000000028128290', 15043.64, 14894.69, 148.95, '洗衣服务费用'],
            [7, 5400111379, None, '24312000000025974538', '上海腾浦起重设备有限公司', '上海腾浦起重设备有限公司',
             '24312000000025974538', 98868.01, 87493.81, 11374.20, '起重设备的销售或维修费用'],
            [8, 5400109303, 3700231130, '21488986', '山东京博中聚新材料有限公司', '山东京博中聚新材料有限公司',
             '21488986', 1206317.8, 1067537.88, 138779.92, '新材料采购费用'],
            [9, 5400107900, 3200232160, '02174427', '中信泰富钢铁贸易有限公司', '中信泰富钢铁贸易有限公司', '02174427',
             49144.15, 43490.40, 5653.75, '钢铁贸易业务的购销款项'],
            [10, 5400098220, 1100232130, '09087077', '中化岩土集团股份有限公司', '中化岩土集团股份有限公司', '09087077',
             368000, 347169.81, 20830.19, '材料采购'],
            [11, 5400104240, 1100232130, '09087076', '中化岩土集团股份有限公司', '中化岩土集团股份有限公司', '09087076',
             120000, 113207.55, 6792.45, '材料采购'],
            [12, 5400109088, 3302231130, '07749873', '恒河材料科技股份有限公司', '恒河材料科技股份有限公司', '07749873',
             488000, 431858.40, 56141.60, '材料采购'],
            [13, 5400107426, 3500232160, '01524116', '利莱森玛电机科技(福州)有限公司', '利莱森玛电机科技(福州)有限公司',
             '01524116', 5044, 4463.72, 580.28, '新产品开发费用'],
            [14, 5400110359, 3500232160, '01524117', '利莱森玛电机科技(福州)有限公司', '利莱森玛电机科技(福州)有限公司',
             '01524117', 2519.9, 2230.00, 289.90],
            [15, 5560005471, 4400231130, '33316056', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司', '33316056',
             27341.83, 25794.18, 1547.65],
            [16, 5560005607, 4400231130, '33316061', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司', '33316061',
             14028.23, 13234.18, 794.05],
            [17, 5560005470, 4400231130, '33316064', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司', '33316064',
             194491.25, 172116.15, 22375.10],
            [18, 5560005605, 4400231130, '33316069', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司', '33316069',
             199223.64, 176304.11, 22919.53],
            [19, 5910187043, 3300232130, '59137347', '莱默尔（浙江）自动化控制技术有限公司',
             '莱默尔（浙江）自动化控制技术有限公司', '59137347', 1704.35, 1508.27, 196.08],
            [20, 5910187782, 3100231130, '10972455', '上海发那科机器人有限公司', '上海发那科机器人有限公司', '10972455',
             50126.98, 44360.16, 5766.82],
            [21, 5910190048, 3100231130, '10853488', '上海发那科机器人有限公司', '上海发那科机器人有限公司', '10853488',
             212.8, 188.32, 24.48],
            [22, 5910185940, 3300232130, '00343057', '浙江精工新能源装备有限公司', '浙江精工新能源装备有限公司',
             '00343057', 1699.99, 1504.42, 195.57],
            [23, 5910180713, 3500232160, '01524111', '利莱森玛电机科技(福州)有限公司', '利莱森玛电机科技(福州)有限公司',
             '01524111', 17000.01, 15044.26, 1955.75],
            [24, None, 2100232130, '00602761', '中国电信股份有限公司沈阳分公司', '中国电信股份有限公司沈阳分公司',
             '00602761', 599, 564.34, 34.66],
            [25, None, 2100224130, '03348137', '中国联合网络通信有限公司沈阳市分公司',
             '中国联合网络通信有限公司沈阳市分公司', '03348137-39', 19849.09, 18441.42, 1407.67],
            [26, None, 2100232130, '00298670', '中国移动通信集团辽宁有限公司沈阳分公司',
             '中国移动通信集团辽宁有限公司沈阳分公司', '00298670/71', 30639.97, 28905.63, 1734.34],
            [27, 5420040668, 2100231130, '04265698', '沈阳胜达仁文商贸有限公司', '沈阳胜达仁文商贸有限公司',
             '04265698/99', 7200, 6371.68, 828.32],
            [28, 5420035952, 3700234130, '09814550', '山东远通汽车零部件有限公司', '山东远通汽车零部件有限公司',
             '09814550', 430779.99, 395211.00, 35568.99],
            [29, 5420035929, 3700234130, '09814549', '山东远通汽车零部件有限公司', '山东远通汽车零部件有限公司',
             '09814549', 111786.21, 105458.69, 6327.52],
            [30, 5420040514, 4400231130, '33316084', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司', '33316084',
             108197.5, 95750.00, 12447.50],
            [31, 5420039188, 4400231130, '33316079', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司', '33316079',
             18255.59, 17222.25, 1033.34],
            [32, 5420038851, 4400231130, '33316078', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司', '33316078',
             38906.85, 36704.58, 2202.27],
            [33, 5420037825, 4400231130, '33316077', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司', '33316077',
             16089.61, 15178.88, 910.73],
            [34, 5420039187, 4400231130, '33316072', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司', '33316072',
             36149.24, 31990.48, 4158.76],
            [35, 5420038850, 4400231130, '33316071', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司', '33316071',
             171540.73, 151805.96, 19734.77],
            [36, 5420037880, 4400231130, '33316070', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司', '33316070',
             71364.6, 63154.51, 8210.09],
            [37, 5420039402, 4400231130, '33316080', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司',
             '33316080-83', 39780.25, 37528.54, 2251.71],
            [38, 5420039599, 4400231130, '33316073', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司',
             '33316073-76', 139185.94, 123173.40, 16012.54],
            [39, 5420035945, 3700231130, '24905908', '济南畅之途轮胎有限公司', '济南畅之途轮胎有限公司', '24905908-12',
             100000, 91743.12, 8256.88],
            [40, 5420035933, 3700231130, '24905837', '济南畅之途轮胎有限公司', '济南畅之途轮胎有限公司', '24905837-39',
             100000, 94339.62, 5660.38],
            [41, 5560005580, 4400231130, '33316065', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司',
             '33316065-68', 175413.76, 155233.42, 20180.34],
            [42, 5560005411, 4400231130, '33316062', '广东明驰实业集团有限公司', '广东明驰实业集团有限公司',
             '33316062/63', 3820.67, 3381.12, 439.55]
        ]

        for item in data:
            self.tree.insert("", "end", values=item)

        combo_values = ["修改", "用途2", "用途3", "用途4", "用途5"]
        combo_var = tk.StringVar(self)
        combo_var.set(combo_values[0])

        def on_select(event):
            selected_item = self.tree.selection()[0]
            self.tree.set(selected_item, "用途", combo_var.get())

        self.tree.bind("<<TreeviewSelect>>", on_select)

        bottom_frame = ttk.Frame(self, padding=10)
        bottom_frame.pack(fill="x", side="bottom")

        button_cancel = ttk.Button(bottom_frame, text="取消",  style="danger.TButton")
        button_cancel.pack(side="right", padx=5, pady=5)

        button_save_settings = ttk.Button(bottom_frame, text="保存",  style="primary.TButton")
        button_save_settings.pack(side="right", padx=5, pady=5)

        self.tree.pack(fill="both", expand=True)
        self.pack(fill="both", expand=True)
