import tkinter as tk
from tkinter import ttk
import ttkbootstrap as ttkbs

from Util import reimburese_util


def test_data():
    return [
        [1, 5400111631, None, '24312000000031337591', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '嘉世坚国际货运代理(上海)有限公司', '推送成功', '24312000000031337591', 9082.8, 9082.80, 0.00,
         '91310000672654859C', '上海市徐汇区汾阳路138号203室 021-64451452'],
        [2, 5400107902, 3200232160, '02174428', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '中信泰富钢铁贸易有限公司',
         '推送成功', '02174428/29', 172282.3, 152462.21, 19820.09, '91320281717880877E',
         '江阴市滨江东路297号 0510-86193388'],
        [4, 5400108169, 3200232160, '02174430', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '中信泰富钢铁贸易有限公司', '推送成功',
         '02174430-43/02174659', 179046, 158447.79, 20598.21, '91320281717880877E',
         '江阴市滨江东路297号 0510-86193388'],
        [19, 5400110249, 3200232160, '02174444', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '中信泰富钢铁贸易有限公司',
         '推送成功', '02174444-49', 184697.6, 163449.2, 21248.4, '91320281717880877E',
         '江阴市滨江东路297号 0510-86193388'],
        [25, 5400111611, 3100231130, '29062655', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '柯尼卡美能达办公系统(中国)有限公司', '推送成功', '29062655/48', 735, 650.44, 84.56, '91310000717860235R',
         '上海市浦东新区海阳西路399号前滩时代广场3楼021-60321200'],
        [27, 5400111625, None, '24312000000028128290', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '上海华记洗衣有限公司', '推送成功',
         '24312000000028128290', 15043.64, 14894.69, 148.95, '91310104792751258J',
         '上海市松江区佘山镇沈砖公路3129弄14号楼三层 021-64015451'],
        [28, 5400111379, None, '24312000000025974538', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '上海腾浦起重设备有限公司', '推送成功',
         '24312000000025974538', 98868.01, 87493.81, 11374.20, '91310120084105562Q',
         '上海市奉贤区望园路2165弄3号258室 021-67182599'],
        [29, 5400109303, 3700231130, '21488986', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '山东京博中聚新材料有限公司',
         '推送成功', '21488986', 1206317.8, 1067537.88, 138779.92, '91371625MA3CNDW67Y',
         '博兴县经济开发区0543-2518120'],
        [30, 5400107900, 3200232160, '02174427', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '中信泰富钢铁贸易有限公司',
         '推送成功', '02174427', 49144.15, 43490.40, 5653.75, '91320281717880877E',
         '江阴市滨江东路297号 0510-86193388'],
        [31, 5400098220, 1100232130, '09087077', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '中化岩土集团股份有限公司',
         '推送成功', '09087077', 368000, 347169.81, 20830.19, '91110000710929148A',
         '北京市大兴工业开发区科苑路13号 61271733'],
        [32, 5400104240, 1100232130, '09087076', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '中化岩土集团股份有限公司',
         '推送成功', '09087076', 120000, 113207.55, 6792.45, '91110000710929148A',
         '北京市大兴工业开发区科苑路13号 61271733'],
        [33, 5400109088, 3302231130, '07749873', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '恒河材料科技股份有限公司', '推送成功',
         '07749873', 488000, 431858.40, 56141.60, '913302006842554254',
         '浙江省宁波石化经济技术开发区滨海路2222号0574-86680027'],
        [34, 5400107426, 3500232160, '01524116', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '利莱森玛电机科技(福州)有限公司', '推送成功', '01524116', 5044, 4463.72, 580.28, '91350100611332776W',
         '福州市仓山区盖山镇艾默生路1号 0591-88000922'],
        [35, 5400110359, 3500232160, '01524117', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '利莱森玛电机科技(福州)有限公司', '推送成功', '01524117', 2519.9, 2230.00, 289.90, '91350100611332776W',
         '福州市仓山区盖山镇艾默生路1号 0591-88000922'],
        [36, 5560005471, 4400231130, '33316056', '未报销', '驰加（上海）汽车用品贸易有限公司', '91310000671184963L',
         '广东明驰实业集团有限公司',
         '推送成功', '33316056', 27341.83, 25794.18, 1547.65, '91440106691514632L',
         '广州市黄埔区贤堂路6号 020-32031688'],
        [37, 5560005607, 4400231130, '33316061', '未报销', '驰加（上海）汽车用品贸易有限公司', '91310000671184963L',
         '广东明驰实业集团有限公司',
         '推送成功', '33316061', 14028.23, 13234.18, 794.05, '91440106691514632L',
         '广州市黄埔区贤堂路6号 020-32031688'],
        [38, 5560005470, 4400231130, '33316064', '未报销', '驰加（上海）汽车用品贸易有限公司', '91310000671184963L',
         '广东明驰实业集团有限公司',
         '推送成功', '33316064', 194491.25, 172116.15, 22375.10, '91440106691514632L',
         '广州市黄埔区贤堂路6号 020-32031688'],
        [39, 5560005605, 4400231130, '33316069', '未报销', '驰加（上海）汽车用品贸易有限公司', '91310000671184963L',
         '广东明驰实业集团有限公司',
         '推送成功', '33316069', 199223.64, 176304.11, 22919.53, '91440106691514632L',
         '广州市黄埔区贤堂路6号 020-32031688'],
        [40, 5910187043, 3300232130, '59137347', '未报销', '米其林沈阳轮胎有限公司', '912101066046211235',
         '莱默尔（浙江）自动化控制技术有限公司',
         '推送成功', '59137347', 1704.35, 1508.27, 196.08, '91330100063983876A',
         '杭州经济技术开发区下沙街道福城路468号 0571-81910600'],
        [41, 5910187782, 3100231130, '10972455', '未报销', '米其林沈阳轮胎有限公司', '912101066046211235',
         '上海发那科机器人有限公司',
         '推送成功', '10972455', 50126.98, 44360.16, 5766.82, '913100006073820251',
         '上海市宝山区富联三路369号021-50327700'],
        [42, 5910190048, 3100231130, '10853488', '未报销', '米其林沈阳轮胎有限公司', '912101066046211235',
         '上海发那科机器人有限公司',
         '推送成功', '10853488', 212.8, 188.32, 24.48, '913100006073820251',
         '上海市宝山区富联路1500号021-50327700'],
        [43, 5910185940, 3300232130, '00343057', '未报销', '米其林沈阳轮胎有限公司', '912101066046211235',
         '浙江精工新能源装备有限公司',
         '推送成功', '00343057', 1699.99, 1504.42, 195.57, '91330621MA2884LU10',
         '绍兴市柯桥区华舍街道鉴湖路2106号 057584883909'],
        [44, 5910180713, 3500232160, '01524111', '未报销', '米其林沈阳轮胎有限公司', '912101066046211235',
         '利莱森玛电机科技(福州)有限公司', '推送成功', '01524111', 17000.01, 15044.26, 1955.75,
         '91350100611332776W', '福州市仓山区盖山镇艾默生路1号 0591-88000922'],
        [45, None, '2100232130', '3702008060', '已报销', '中国人民财产保险股份有限公司上海分公司',
         '913100001679309150', '上海申能汽车技术服务有限公司',
         '推送成功', '3702008060', 46070.76, 40787.85, 6282.91, '91310115607303982E',
         '上海市杨浦区国定路588弄43号1号楼020-26677610'],
        [46, None, '2100232130', '3702008059', '已报销', '中国人民财产保险股份有限公司上海分公司',
         '913100001679309150', '上海申能汽车技术服务有限公司',
         '推送成功', '3702008059', 19135.03, 16949.25, 2185.78, '91310115607303982E',
         '上海市杨浦区国定路588弄43号1号楼020-26677610'],
        [47, None, '2100232130', '3702008049', '已报销', '中国人民财产保险股份有限公司上海分公司',
         '913100001679309150', '上海申能汽车技术服务有限公司',
         '推送成功', '3702008049', 23068.43, 20410.57, 2657.86, '91310115607303982E',
         '上海市杨浦区国定路588弄43号1号楼020-26677610'],
        [48, None, '2100232130', '3702008036', '已报销', '中国人民财产保险股份有限公司上海分公司',
         '913100001679309150', '上海申能汽车技术服务有限公司',
         '推送成功', '3702008036', 49144.15, 43490.40, 5653.75, '91310115607303982E',
         '上海市杨浦区国定路588弄43号1号楼020-26677610'],
        [33, 5400092961, 4400231130, '33316056', '未报销', '驰加（上海）汽车用品贸易有限公司', '91310000671184963L',
         '广东明驰实业集团有限公司', '推送成功', '33316056', 27341.83, 25794.18, 1547.65, '91440106691514632L',
         '广州市黄埔区贤堂路6号 020-32031688'],
        [34, 5400107426, 3500232160, '01524116', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '利莱森玛电机科技(福州)有限公司', '推送成功', '01524116', 5044, 4463.72, 580.28, '91350100611332776W',
         '福州市仓山区盖山镇艾默生路1号 0591-88000922'],
        [35, 5400110359, 3500232160, '01524117', '未报销', '上海米其林轮胎有限公司', '91310000607429866C',
         '利莱森玛电机科技(福州)有限公司', '推送成功', '01524117', 2519.9, 2230.00, 289.90, '91350100611332776W',
         '福州市仓山区盖山镇艾默生路1号 0591-88000922'],
        [36, 5560005471, 4400231130, '33316056', '未报销', '驰加（上海）汽车用品贸易有限公司', '91310000671184963L',
         '广东明驰实业集团有限公司', '推送成功', '33316056', 27341.83, 25794.18, 1547.65, '91440106691514632L',
         '广州市黄埔区贤堂路6号 020-32031688'],
        [37, 5560005607, 4400231130, '33316061', '未报销', '驰加（上海）汽车用品贸易有限公司', '91310000671184963L',
         '广东明驰实业集团有限公司', '推送成功', '33316061', 14028.23, 13234.18, 794.05, '91440106691514632L',
         '广州市黄埔区贤堂路6号 020-32031688'],
        [38, 5560005470, 4400231130, '33316064', '未报销', '驰加（上海）汽车用品贸易有限公司', '91310000671184963L',
         '广东明驰实业集团有限公司', '推送成功', '33316064', 194491.25, 172116.15, 22375.10, '91440106691514632L',
         '广州市黄埔区贤堂路6号 020-32031688'],
        [39, 5560005605, 4400231130, '33316069', '未报销', '驰加（上海）汽车用品贸易有限公司', '91310000671184963L',
         '广东明驰实业集团有限公司', '推送成功', '33316069', 199223.64, 176304.11, 22919.53, '91440106691514632L',
         '广州市黄埔区贤堂路6号 020-32031688'],
        [40, 5910187043, 3300232130, '59137347', '未报销', '米其林沈阳轮胎有限公司', '912101066046211235',
         '莱默尔（浙江）自动化控制技术有限公司', '推送成功', '59137347', 1704.35, 1508.27, 196.08,
         '91330100063983876A',
         '杭州经济技术开发区下沙街道福城路468号 0571-81910600'],
        [41, 5910187782, 3100231130, '10972455', '未报销', '米其林沈阳轮胎有限公司', '912101066046211235',
         '上海发那科机器人有限公司', '推送成功', '10972455', 50126.98, 44360.16, 5766.82, '913100006073820251',
         '上海市宝山区富联三路369号021-50327700'],
        [42, 5910190048, 3100231130, '10853488', '未报销', '米其林沈阳轮胎有限公司', '912101066046211235',
         '上海发那科机器人有限公司', '推送成功', '10853488', 212.8, 188.32, 24.48, '913100006073820251',
         '上海市宝山区富联路1500号021-50327700'],
        [43, 5910185940, 3300232130, '00343057', '未报销', '米其林沈阳轮胎有限公司', '912101066046211235',
         '浙江精工新能源装备有限公司', '推送成功', '00343057', 1699.99, 1504.42, 195.57, '91330621MA2884LU10',
         '绍兴市柯桥区华舍街道鉴湖路2106号 057584883909'],
    ]


class ReimburseManagement(tk.Frame):
    """
    报销管理界面
    """

    def __init__(self, master):
        tk.Frame.__init__(self, master)
        self.type_search = None
        self.searchpanel = None
        self.entryFrame = None
        self.input_edit = None
        self.overlay = None
        self.master = master
        self.reimburese = reimburese_util.ReimburseUtil()
        master.title("财务流程自动化 - 报销管理")
        # style = ttkbs.Style(theme="minty")
        left_frame = ttk.Frame(self, style="primary.TFrame", padding=10)
        left_frame.pack(fill="y", side="left")
        # 在左侧功能框架添加按钮
        button_invoice_search = ttk.Button(
            left_frame, text="发票搜索", style="primary.Outline.TButton", command=lambda: self.invoice_search())
        button_invoice_search.pack(fill="x", padx=5, pady=5)

        button_invoice_classification = ttk.Button(
            left_frame, text="发票分类", style="primary.Outline.TButton", command=lambda: self.search_by_type())
        button_invoice_classification.pack(fill="x", padx=5, pady=5)

        # button_invoice_edit = ttk.Button(
        #     left_frame, text="发票编辑", style="primary.Outline.TButton")
        # button_invoice_edit.pack(fill="x", b=5, pady=5)

        # button_invoice_delete = ttk.Button(
        #     left_frame, text="发票删除", style="primary.Outline.TButton")
        # button_invoice_delete.pack(fill="x", padx=5, pady=5)

        # 创建表格
        table_frame = ttk.Frame(self)
        table_frame.pack(fill="both", expand=True, padx=10, pady=5)  # 调整表格的间距

        # style.configure("Treeview", background="#f9f9f9",
        #                 foreground="black", font=('微软雅黑', 10))
        # style.configure("Treeview.Heading", font=('微软雅黑', 10, 'bold'))

        columns = ['序号', '订单号', '供应商订单号', 'SAP编号', '报销状态', '供应商名称', '供应商税号',
                   '购方名称', '推送状态', '商品编号', '金额', '不含税金额', '税额', '购方税号', '购方地址电话']
        self.tree = ttk.Treeview(table_frame, columns=columns, show="headings")

        # 设置列宽度
        for col in columns:
            self.tree.heading(col, text=col, anchor=tk.CENTER)
            self.tree.column(col, anchor=tk.CENTER, minwidth=50, width=100)  # 调整列宽度
        self.tree.column('序号', width=50)
        self.tree.column('订单号', width=200)
        self.tree.pack(fill="both", expand=True)

        # 添加示例数据

        #self.reference_tree(test_data())
        self.reference_tree(self.reimburese.get_list())
        # # 创建底部按钮
        # bottom_frame = ttk.Frame(self, padding=5)
        # bottom_frame.pack(fill="x", side="bottom")
        #
        # button_save = ttk.Button(bottom_frame, text="保存",
        #                          style="primary.TButton")
        # button_save.pack(side="right", padx=5)
        #
        # button_cancel = ttk.Button(bottom_frame, text="取消",
        #                            style="danger.TButton")
        # button_cancel.pack(side="right", padx=5)
        #
        # button_close = ttk.Button(bottom_frame, text="关闭",
        #                           style="danger.Outline.TButton")
        # button_close.pack(side="right", padx=5)
        self.pack(fill="both", expand=True)

    def reference_tree(self, data):
        self.tree.delete(*self.tree.get_children())
        for item in data:
            self.tree.insert("", "end", values=item)

    def search(self):
        if self.input_edit.get() == "":
            self.reference_tree(test_data())
        else:
            self.reference_tree(self.reimburese.query(self.input_edit.get()))
        # 搜索执行完毕后关闭搜索框
        self.destroy_(self.overlay)

    def invoice_search(self):
        self.overlay = tk.Frame(self, bg="gray")
        self.overlay.place(relx=0.5, y=50, relwidth=0.5, height=100,
                           anchor='n')  # or: bad anchor "aadsf": must be n, ne, e, se, s, sw, w, nw, or center
        self.entryFrame = tk.Frame(self.overlay, padx=10, pady=10)
        self.entryFrame.pack(fill="x", expand=True)
        self.input_edit = tk.Entry(self.entryFrame, font=("微软雅黑", 41))
        self.input_edit.bind("<Escape>", lambda e: self.destroy_(self.overlay))
        self.input_edit.bind("<Return>", lambda e: self.search())
        self.input_edit.pack(fill="x", expand=True)
        self.input_edit.focus_set()

    def destroy_(self, entity):
        entity.destroy()
        self.update()

    def search_type(self):
        select_options = [var.get() for var in self.check_vas if var.get() != ""]
        if select_options:
            self.reference_tree(self.reimburese.query_by_type(select_options))
        self.destroy_(self.searchpanel)

    def search_by_type(self):
        self.searchpanel = tk.Frame(self, bg="gray")
        self.searchpanel.place(relx=0.5, y=50, width=400, anchor='n')
        self.type_search = tk.Frame(self.searchpanel, bg="gray", bd=2, relief="solid")
        self.type_search.place(width=325, x=25, y=5)

        invoice_type = self.reimburese.get_invoice_type()
        print(invoice_type)
        if invoice_type == []:
            invoice_type = [["未知"], ["未知"], ["未知"]]
        self.check_vas = []
        for option in invoice_type:
            print(option[0])
            check_var = tk.StringVar(value=option[0])
            self.check_vas.append(check_var)
            checkbutton = tk.Checkbutton(self.type_search, text=option, variable=check_var, onvalue=option, offvalue="")
            checkbutton.pack(anchor="w", expand=False)

        height = sum(child.winfo_reqheight() for child in self.type_search.winfo_children())
        self.type_search.config(height=height + 30)
        self.type_search.update()

        # 绘制筛选和关闭按钮
        search_button = ttk.Button(self.searchpanel, text="筛选", style="primary.TButton",
                                   command=lambda: self.search_type())
        search_button.place(relx=0.8, rely=1, anchor="se", x=-10, y=-10)
        search_button = ttk.Button(self.searchpanel, text="关闭", style="danger.Outline.TButton",
                                   command=lambda: self.destroy_(self.searchpanel))
        search_button.place(relx=1, rely=1, anchor="se", x=-10, y=-10)
        self.searchpanel.config(height=sum(child.winfo_reqheight() for child in self.searchpanel.winfo_children()),
                                width=self.type_search.winfo_width())
        self.searchpanel.update()
